IDEA StatiCa Open Model
RebarPolyLine3D.Segments Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets segments of RebarPolyLine3D.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<RebarSegment3DBase> Segments { get; set; }
Public Property Segments As List(Of RebarSegment3DBase)
	Get
	Set
public:
property List<RebarSegment3DBase^>^ Segments {
	List<RebarSegment3DBase^>^ get ();
	void set (List<RebarSegment3DBase^>^ value);
}
Property Value
Type: List<RebarSegment3DBase>
See Also
Reference
RebarPolyLine3D Class
IdeaRS.OpenModel.Model Namespace